app/controllers/events_controller.rb

  def destroy
    @event = Event.find(params[:id])
    if current_user&.is_admin?
      @event.destroy
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 1]]

  def index
    @future_events = Event.select { |event| event.date.future? }.sort_by &:date
---
SELECT "events".* FROM "events"

  def update
    @event = Event.find(params[:id])
    if current_user&.is_admin?
      if @event.update(event_params)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "events" SET "location" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["location", "Somewhere"], ["updated_at", "2019-02-15 21:19:19.646692"], ["id", 2]]

  def guests
    @event = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @event = Event.new(event_params)
    if current_user&.is_admin?
      if @event.save
---
INSERT INTO "events" ("title", "description", "location", "created_at", "updated_at", "capacity", "date") VALUES (?, ?, ?, ?, ?, ?, ?)

  def show
    @event = Event.find(params[:id])
    if current_user
      @registration = @event.registrations.find_by(user_id: current_user.id)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "registrations".* FROM "registrations" WHERE "registrations"."event_id" = ? AND "registrations"."user_id" = ? LIMIT ?  [["event_id", 1], ["user_id", 1], ["LIMIT", 1]]