app/controllers/registration_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "registrations".* FROM "registrations" WHERE "registrations"."user_id" = ? AND "registrations"."event_id" = ? LIMIT ?  [["user_id", 1], ["event_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "guests" INNER JOIN "registrations" ON "guests"."registration_id" = "registrations"."id" WHERE "registrations"."event_id" = ?  [["event_id", 1]]
INSERT INTO "registrations" ("user_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["event_id", 1], ["created_at", "2019-02-14 06:34:57.281222"], ["updated_at", "2019-02-14 06:34:57.281222"]]
---
  def new
    user_id = params[:user_id].to_i
    event = Event.find(params[:event_id])
    if current_user.id == user_id && !(user_already_registered? user_id, event.id) && event.start_date.future?
      @registration = Registration.new(
        user_id: user_id,
        event_id: event.id,
        waitlisted: false
      )
      if (1 + @registration.guests.size) > event.spots_remaining
        @registration.assign_attributes(waitlisted: true)
        @registration.save

SELECT  "registrations".* FROM "registrations" WHERE "registrations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "registrations" WHERE "registrations"."id" = ?  [["id", 1]]
---
  def destroy
    if params[:registration_id].present?
      @registration = Registration.find(params[:registration_id])
    else
      @registration = Registration.find_by(user_id: params[:guest_id], event_id: params[:id])
    end

    if ((current_user == @registration.user) || current_user.is_admin?) && @registration.event.start_date.future?
      user_waitlisted = @registration.waitlisted
      event = @registration.event
      @registration.destroy