app/controllers/session_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "email", "name") VALUES (?, ?, ?, ?)  [["created_at", "2019-02-14 06:29:05.266323"], ["updated_at", "2019-02-14 06:29:05.266323"], ["email", "deogan@uwindsor.ca"], ["name", "Harshdip Deogan"]]
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "deogan@uwindsor.ca"], ["LIMIT", 1]]
---
  def create
    provider = params[:provider]
    if provider == "google_oauth2"
      user = User.find_or_create_by(:email => auth_hash[:info][:email]) do |user|